REGULAR_TOKENS = [
   'минут в день',
   'личные сообщения',
   'от 20',
	'от 18',
   'часов в день',
	'партнер',
	'партнёр',
	'научи',
	'научу',
	'бесплатное обучение',
	'удалённ',
	'удаленн',
	'гарант',
	'легальн',
	'кому интерес',
	'сотрудничеств',
	'кypaтop',
   'в лс',
	'ЛС',
	'в л.с.',
	'совершеннолетн',
   '18+',
	'oнлaйн cфeр',
	'вoзьмy на oбyчeниe',
	'нужен материал по'
]

ADULT_TOKENS = {
	'интим',
	'голы',
	'oбнаж'
}

BETTING_TOKENS = {
	'букмекер',
	'выигрыш',
	'казино',
	'Казино',
	'TONCOIN',
	'депозит'
}

FINCRYPTO_TOKENS = {
	'бинанс', 
	'байбит', 
	'Okx', 
	'Mexc', 
	'Gate',
	'crypt',
   'арбитраж',
   'бирж',
   'прибыл',
   'доход',
   '0$',
	'0 $',
	'доллaр',
	'личка',
	'оплат',
	'доп. зара',
   'заработ'
	'аирдроп', 
	'тестнет',
	'цифpовых вaлют',
	'трейдинг'
}

EXAMPLES_FOR_NEW_SUPER_REGEXP = {
	'Ищу партнеров для заработка пассивной прибыли, много времени не занимает + хороший еженедельный доп.доход. Пишите + в личные',
   'Ищу людей для заработка на дистанционной основе в свободное время, за деталями в личные сообщения',
	'''👋Приветствую!                                                      
Ищу  партнёров к себе в команду
Новая очень перспективная сфера
200-500$  в сутки ( Все прозрачно )  
Удалённая занятость
Пишите + в Лс для подробностей.
''',
    'Хотите увеличить свой доход, затрачивая минимум времени и работая удаленно? Присоединяйтесь к нашей команде. Мы ищем совершеннолетних целеустремленных людей. Пишите в лс +',
	 'Всех приветствую. Я набираю команду под проект. Еженедельная прибыль от 500 долларов, минимум времени и бесплатное обучение. Писать в личные сообщения.'
}

# Not used
CRITICAL_TOKENS = [
]